AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>#9777</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей/Ext/ManagerModule.bsl
//Возвращает ИСТИНА, если остатков по заказу хватает и ЛОЖЬ, если не закрытых заказов меньше, чем пытаемся отгрузить
Функция КонтрольОстатков(Знач Документ, Знач Заказ,Знач ТаблицаТовары, Знач ДатаДвижения = Неопределено) Экспорт
	
	Результат = Истина;
	
	Если (ДатаДвижения = Неопределено) или (ДатаДвижения = Дата(1,1,1)) Тогда
		ДатаДвижения = Документ.Дата;
	КонецЕсли;
	
	ВремТаблицаТовары = Новый ТаблицаЗначений;
	ВремТаблицаТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВремТаблицаТовары.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВремТаблицаТовары.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	//ВремТаблицаТовары.Колонки.Добавить("Коэффициент",Новый ОписаниеТипов("число"));
	ВремТаблицаТовары.Колонки.Добавить("Заказ");
	Для Каждого ТекущаяСтрока Из ТаблицаТовары Цикл
		Если ТекущаяСтрока.Заказ = Заказ Тогда
			Если Документ.Организация <> Заказ.Организация Тогда
				Сообщить("По номенклатуре:" + ТекущаяСтрока.Номенклатура + " организация указанная в документе не совпадает с организацией указанной в документе " + Заказ + ". В проведении отказано.");
				Результат = Ложь;
				Возврат Результат;
			КонецЕсли;	
			Если Документ.Контрагент <> Заказ.Контрагент Тогда
				Сообщить("По номенклатуре:" + ТекущаяСтрока.Номенклатура + " контрагент указанный в документе не совпадает с контрагентом указанным в документе " + Заказ + ". В проведении отказано.");
				Результат = Ложь;
				Возврат Результат;
			КонецЕсли;	
			Если НЕ ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.ОстаткиПленки
				И Не ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.ПолотноЗаказчика Тогда
				НоваяСтрока = ВремТаблицаТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				НоваяСтрока.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВремТаблицаТовары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, Заказ", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСписания",Документ);
	Запрос.УстановитьПараметр("ТекДата",ДатаДвижения);
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Запрос.УстановитьПараметр("ТаблицаТовары",ВремТаблицаТовары);

	ВременныеТаблицы = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокСписания.Номенклатура КАК Номенклатура,
	|	ДокСписания.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(СУММА(ДокСписания.Количество), 0) КАК ЧИСЛО(15, 2)) КАК Количество,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(СУММА(Остатки.КоличествоОстаток), 0) КАК ЧИСЛО(15, 2)) КАК КоличествоОстаток
	|ИЗ
	|	ТаблицаТовары КАК ДокСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
	//++ №8749 дата остатков текущая, чтобы учитывал возвраты
	//|				&ТекДата,
	|				,
	//-- №8749
	|				ЗаказНаПроизводство = &Заказ
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ДокСписания.Номенклатура
	|						ИЗ
	|							ТаблицаТовары КАК ДокСписания)) КАК Остатки
	|		ПО (Остатки.Номенклатура = ДокСписания.Номенклатура)
	|			И (Остатки.ХарактеристикаНоменклатуры = ДокСписания.ХарактеристикаНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокСписания.Номенклатура,
	|	ДокСписания.ХарактеристикаНоменклатуры";
	
	ВыборкаСписание = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСписание.Следующий() Цикл
		Если ВыборкаСписание.КоличествоОстаток < ВыборкаСписание.Количество Тогда
			Сообщить("По " + Заказ + " списывается " + ВыборкаСписание.Номенклатура + ?(ЗначениеЗаполнено(ВыборкаСписание.ХарактеристикаНоменклатуры), " (" + ВыборкаСписание.ХарактеристикаНоменклатуры + ")", "") + 
					 " в количестве = " + ВыборкаСписание.Количество + 
					 ", остаток по заказу = " + ВыборкаСписание.КоличествоОстаток,СтатусСообщения.Важное);
			Результат = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;

	
КонецФункции
